import shutil
from pathlib import Path

import regex as re
from tqdm import tqdm

NON_END = r"[^\n…。？！]*"

fixes: dict[str, list[tuple[str, str]]] = {
    "*": [
        ("╳", "×"),
        ("又再", "再"),
        ("诸于", "之于"),
        ("塑胶", "塑料"),
        ("荧幕", "屏幕"),
        ("人型", "人形"),
        ("叫作", "叫做"),
        ("妈啦", "妈呀"),
        ("自称叫", "自称"),
        ("冷气机", "空调"),
        ("程序码", "代码"),
        ("一、两", "一两"),
        ("安心感", "安全感"),
        ("抛弃式", "一次性"),
        ("打手机", "打电话"),
        ("几乎已经", "几乎"),
        ("不自主", "不由自主"),
        ("冲击力道", "冲击力"),
        ("学校公交车", "校车"),
        ("视窗(?!口)", "窗口"),
        ("除错(?!误)", "调试"),
        ("荷包(?!蛋)", "钱包"),
        ("原本上条", "上条原本"),
        ("密不通风", "密不透风"),
        ("三千〇一", "三千零一"),
        ("不忍卒睹", "不忍直视"),
        ("死亡关头", "生死关头"),
        ("电动游戏", "电子游戏"),
        ("魔[法导]书", "魔道书"),
        ("(?<=[一千])册", "本"),
        ("(?<!不能)自已", "自己"),
        ("架人造卫星", "颗人造卫星"),
        ("由下往上看", "从下往上看"),
        ("(?<=[除并]非)是(?!否)", ""),
        ("粘着(?=我|上条|少年)", "黏着"),
        (rf"(?<=(因为|由于){NON_END}，)因[此而]", "所以"),
        (rf"由于(?={NON_END}所以)", "因为"),
        (rf"(?<=(看来|来看，){NON_END}|来看(自己)?)似乎", ""),
        (r"(?<=[\d零一二三四五六七八九十百千万亿兆])圆(?![顶周])", "元"),
        (
            rf"(?<=(因|由于){NON_END})(?<!特别|机构|良好|丧命|是这样|冲击波|立场上|「暗部」)(之故|所致|的关系|的缘故)",
            "",
        ),
        (
            "(?<=理由(，|却不|应该|并不|自然|，多半|，想来只|无他，正|会不会就|，有一种说法|很多，但大半|也很离谱：并不|啊，到头来，该不会)?是)因为",
            "",
        ),
    ],
    "[S0_00]读前必看": [
        ("以台版为本体", "以台版为基础"),
        ("优化了并", "优化并"),
        ("以本人一己之力", "以一己之力"),
        ("没必要感觉", "感觉没必要"),
        ("部分模糊，部分没有翻译", "部分图片模糊，部分文字没有翻译"),
        ("部分模糊，繁体字看着累", "部分图片模糊，繁体字阅读困难"),
        ("原图重新修嵌，美观而且清晰", "原图重新修复嵌字，美观且清晰"),
        ("部分用词不符合大陆人习惯", "部分用词不符合大陆习惯"),
        ("大部分跟随维基或汉化组的最新标准", "大部分遵循维基或汉化组的最新标准"),
        ("持续更新，且有问题可以实时反馈", "持续更新，且可以实时反馈问题"),
        (
            "自己主观上觉得有问题的，希望能自己结合日语原版、英翻，来给出明确的解决方案。",
            "如果觉得有问题，希望能结合日语原版和英译，给出明确的解决方案。",
        ),
    ],
    "[S1_01]某魔法的禁书目录 01X": [
        ("无以言喻", "难以言喻"),
        ("毫无抵御能力", "毫无抵御之力"),
        ("梳理台", "洗漱台"),
        ("长度到达脚踝", "长度到脚踝"),
        ("升了上来", "抬了起来"),
        ("毫无理由的不相信", "毫无理由地不相信"),
        ("杜林圣骸布", "都灵圣骸布"),
        ("前十名内的", "前十名的"),
        ("皱了眉头", "皱起了眉头"),
        ("手机电话号码", "手机号码"),
        ("重启机按钮", "重启按钮"),
        ("张不开眼睛", "睁不开眼睛"),
    ],
    "[S1_02]某魔法的禁书目录 02X": [
        ("村人", "村民"),
        ("繁华地带完全没有人", "繁华地带，竟然完全没有人"),
        ("往上条袭来", "袭往上条"),
        ("反过来说，每次", "那么每次"),
        ("首先轻叹", "轻叹"),
        ("插在颈上", "插在脖子上"),
    ],
    "[S1_03]某魔法的禁书目录 03X": [
        ("参了各种营养剂", "掺了各种营养剂"),
        ("改良于海湾战争中", "在海湾战争中改良"),
        ("这把狙击枪因为", "因为这把狙击枪"),
        ("子弹弹壳", "子弹壳"),
        ("连发机能", "连发功能"),
        ("中性子", "中子"),
        ("不可思议怪谈", "不可思议"),
        ("350×19＝6.65", "0.35×19＝6.65"),
        ("钢铁铁轨", "钢铁轨道"),
        ("几乎差点", "差点"),
    ],
    "[S1_04]某魔法的禁书目录 04X": [
        ("求偿", "索赔"),
        ("张了张", "看了看"),
        ("不知为何土御门", "土御门不知为何"),
        ("绝不能遭到玷污", "绝不能玷污"),
        ("确实的位置", "确切的位置"),
        ("子弹却刺入", "子弹却射入"),
    ],
    "[S1_05]某魔法的禁书目录 05X": [
        ("塑料瓶饮料", "塑料瓶装饮料"),
        ("冷气的室外机", "空调的室外机"),
        ("有及肩的茶色头发及不服输的表情", "有着及肩的茶色头发和不服输的表情"),
        ("可让其他医生", "其他医生可"),
        ("光碟片", "光盘"),
        ("刑求", "刑讯"),
        ("跄跄踉踉", "踉踉跄跄"),
        ("项圈带", "项圈"),
        ("索讨", "索要"),
        ("力力", "力"),
        ("采排外政策", "采取排外政策"),
        ("身染宿疾", "身患宿疾"),
        ("也不参加文化祭", "也不必参加文化祭"),
        ("粗鲁地突然往前狂冲", "突然粗鲁地往前狂冲"),
        ("流用品", "淘汰品"),
        ("影像电话", "视频电话"),
        ("断乳餐", "辅食"),
        ("小小电脑", "小小的电脑"),
        ("操纵把手", "操纵杆"),
    ],
    "[S1_06]某魔法的禁书目录 06X": [
        ("开学式", "开学典礼"),
        ("有及肩的茶色头发", "有着及肩的茶色头发"),
    ],
    "[S2_01]新约 某魔法的禁书目录 01X": [
        ("参了一脚", "插了一脚"),
    ],
    "[S2_16]新约 某魔法的禁书目录 16X": [
        ("光碟", "光盘"),
    ],
    "[S3_06]创约 某魔法的禁书目录 06X": [
        ("干点别的话", "干点别的的话"),
    ],
    "[S5_03_02]某魔法的禁书目录SS 生物黑客篇X": [
        ("由于这道菜里", "因为这道菜里"),
    ],
    "[S5_04_01]某科学的超电磁炮SS3 斯塔蒂瓦里篇X": [
        ("程式", "程序"),
        ("谁都能看得出现的异常", "谁都能看得出的异常"),
    ],
}


def fixed(vol: str, content: str) -> str:
    for old, new in fixes["*"] + (fixes[vol] if vol in fixes else []):
        content = re.sub(old, new, content)
    return content


def x2y():
    x, y = Path("X"), Path("Y")
    shutil.rmtree(y)
    for vol in tqdm(list(x.iterdir())):
        shutil.copytree(vol, y / vol.name)
        for file in (y / vol.name).rglob("*"):
            if file.suffix not in (".xhtml", ".opf", ".ncx"):
                continue
            with open(file, "r", encoding="utf-8") as f:
                content = f.read()
            with open(file, "w", encoding="utf-8") as f:
                f.write(fixed(vol.name, content))


if __name__ == "__main__":
    x2y()
